04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/hydrofoil/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

cp 0/U.liquid.orig 0/U
runApplication potentialFoam -pName p_rgh
cp 0/U 0/U.gas
cp 0/U 0/U.liquid

runApplication decomposePar
runParallel foamRun
runApplication reconstructPar

validation/createGraph

#------------------------------------------------------------------------------
