04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/hydrofoil/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

interpolationSchemes
{
    default         linear;
}

divSchemes
{
    default         none;

    div(phi,alpha)  Gauss vanLeer;

    div(alphaRhoPhi,U) Gauss linearUpwind limited;
    div(alphaRhoPhi,h) Gauss linearUpwind limited;
    div(alphaRhoPhi,e) Gauss linearUpwind limited;
    div(alphaRhoPhi,f) Gauss upwind;
    div(alphaRhoPhi,K) Gauss linearUpwind limited;
    div(alphaRhoPhi,k) Gauss upwind;
    div(alphaRhoPhi,omega) Gauss upwind;

    div(alphaRhoPhi,(p|rho)) Gauss linearUpwind limited;

    div((((alpha*rho)*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

snGradSchemes
{
    default        corrected;
}

wallDist
{
    method          meshWave;
    correctWalls    true;
}


// ************************************************************************* //
